adarshmodh/quadcopter_STM32F3/quad_project.c
#include "stm32f30x.h"
#include "stm32f30x_it.h"
#include<stdio.h>
#include<stdlib.h>
#include<math.h>
#include "stm32f3_discovery_lsm303dlhc.h"
#include "stm32f3_discovery_l3gd20.h"
#include <string.h>

#ifndef _ACC_C_
#define _ACC_C_
 

#define LSM_Acc_Sensitivity_2g     (float)     1.0f            /*!< accelerometer sensitivity with 2 g full scale [LSB/mg] */
#define LSM_Acc_Sensitivity_4g     (float)     0.5f            /*!< accelerometer sensitivity with 4 g full scale [LSB/mg] */
#define LSM_Acc_Sensitivity_8g     (float)     0.25f           /*!< accelerometer sensitivity with 8 g full scale [LSB/mg] */
#define LSM_Acc_Sensitivity_16g    (float)     0.0834f         /*!< accelerometer sensitivity with 12 g full scale [LSB/mg] */

#define PI                         (float)     3.14159265f

#define angle                         (float)     57.295779578552f

#define L3G_Sensitivity_250dps     (float)   114.285f         /*!< gyroscope sensitivity with 250 dps full scale [LSB/dps] */
#define L3G_Sensitivity_500dps     (float)    57.1429f        /*!< gyroscope sensitivity with 500 dps full scale [LSB/dps] */
#define L3G_Sensitivity_2000dps    (float)    14.285f	      /*!< gyroscope sensitivity with 2000 dps full scale [LSB/dps] */

#define order 5

LSM303DLHCAcc_InitTypeDef LSM303DLHCAcc_InitStructure;
LSM303DLHCAcc_FilterConfigTypeDef LSM303DLHCFilter_InitStructure;
LSM303DLHCMag_InitTypeDef LSM303DLHC_InitStructure;
L3GD20_InitTypeDef L3GD20_InitStructure;
L3GD20_FilterConfigTypeDef L3GD20_FilterStructure;
TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
GPIO_InitTypeDef GPIO_InitStructure;
TIM_ICInitTypeDef  TIM_ICInitStructure;
NVIC_InitTypeDef NVIC_InitStructure;
TIM_OCInitTypeDef  TIM_OCInitStructure;

void Acc_Config(void);
void Acc_ReadData(float* pfData);
void TIM_Config(void);
void gyroConfig(void);
void gyroReadAngRate (float* pfData);
void GPIO_Config(void);
void USART3_Config(void);
void compassConfig(void);
void compassReadMag (float* pfData);

void test_flag(void);
void get_height(void);
void usart_send(void);
void med_filter(int order_val);

int throt_check=0,integral_flag=0;
uint16_t PrescalerValue = 0,read=0;
float avg=0.0f,ratio=0.0f;
float pitch=0.0f,pitch_acc=0.0f,set_pitch=0.0f,error_pitch[2]={0.0f},sum_pitch=0.0f;
float roll=0.0f,roll_acc=0.0f,set_roll=0.0f,error_roll[2]={0.0f},sum_roll=0.0f;
float yaw=0.0f,yaw_acc=0.0f,set_yaw=0.0f,error_yaw[2]={0.0f},sum_yaw=0.0f;

float set_height[2]={0.0f},error_height[2]={0.0f},sum_height=0.0f;

float u=0.0f,u_roll=0.0f,u_pitch=0.0f,u_yaw=0.0f,kp=0.0f,ki=0.0f,kd=0.0f,ccr;       //pitch 1.3,1.9,0.018

float k_p[4]={1.4,1.5,1.90,0.0},k_i[4]={0.135,0.125,0.0,0.0},k_d[4]={0.24,0.29,0.8,0};

//float k_p[4]={1.4,1.5,0,0},k_i[4]={0.135,0.125,0.0,0.0},k_d[4]={0.24,0.29,0,0};

//float k_p[4]={1.4,1.5,0,0},k_i[4]={0.135,0.45,0.0,0},k_d[4]={0.24,0.25,0,0};        //stable values pitch 0.56,0.115,0.29

//float k_p[4]={0,0,2.0,0},k_i[4]={0,0,0.0,0},k_d[4]={0,0,0.0,0};  

float tmp_roll,tmp_pitch=0;
float sin_angle,cos_angle,angle_raw=0;

//float k_p[3]={0.0,0.0,0},k_i[3]={0.0,0.0,0.0},k_d[3]={0.0,0.0,0},p_roll=0.0f;//0.4444=k_p k_d=0.0277 k_d[0]=0.01944 2.1,0.11,0.25
//float k_p[3]={0.72,0.56,1.07},k_i[3]={0.0629,0.09,0.6},k_d[3]={0.24,0.29,0.28};        //stable values
//float k_p[3]={0.56,0.37,2.7},k_i[3]={0.0629,0.0044,0},k_d[3]={0.122,0.109,0.0};
//float k_p[3]={0.0,1.3,0.0},k_i[3]={0.0,1.85,0.0},k_d[3]={0.0,0.018,0.0};

float ccr_roll=0.0f,ccr_pitch=0.0f,ccr_yaw=0.0f,meas_roll=0.0f,meas_pitch=0.0f,meas_yaw=0.0f;
float ccr_front_motor=0.0f,ccr_back_motor=0.0f,ccr_left_motor=0.0f,ccr_right_motor=0.0f,CCR_prev=500.0f;
float meas[3]={0.0f};
float mpitch=0,mroll=0,myaw=0;
int times=0;
float arr_gyro[5][3]={0.0f};
float arr_acc[5][3]={0.0f};
float arr_mag[5][3]={0.0f};
float ccr_throttle=0.0f,ccr_height=0.0f;
float AccBuffer[3] = {0.0f};
float W=0.90;
float x=0.0f,y=0.0f,z=0.0f;
float sum_counts=0.0f;
int z1=0;

float a=0.0f,b=0.0f;
int counts=0;

float Axz_0=0.0f,Ayz_0=0.0f,Axz,Ayz,Rxest,Rxest_0=0.0f,Ryest,Ryest_0=0.0f,Rzest,Rzest_0=0.0f,Rate_Axz,Rate_Axz_0=0.0f;
float Rate_Ayz,Rate_Ayz_0=0.0f,Rate_Axz_avg,Rate_Ayz_avg;
float Rx_gyro,Ry_gyro,Rz_gyro,Rx_acc,Ry_acc,Rz_acc,Roll_gyro,Pitch_gyro,kangle=0.0f;

float GyroBuffer[3] = {0.0f},Gyrooffset[3]={0.0f},Gyrooffset_prev[3]={0.0f},Gyroavg[3],Gyroavg_1[3]={0.0f},Gyroavg_2[3]={0.0f},Gyroangle[3] = {0.0f},Accavg[3]={0.0f},Accavg_1[3]={0.0f},t_kal=1.0f/180.0f,t=1.0f/100.0f,Final_gyro[3],observe[100];
float Mag_abs=0.0f,Magavg[3]={0.0f},Magavg_1[3]={0.0f};
int n=0,k=0,count=0,read5=0,check=0,counter=0,readsensor=0,counter2=0,retard=0,delayy=2,pass=0;
char m=1;
float MagBuffer[3] = {0.0f},mag=0.0f,dir=0.0f,initdir=0.0f,yaw_dir=0.0f,yaw_dir_avg=0.0,sum_dir=0.0f;
unsigned int mag_angle=0;
float Mag_avg=0.0f,mag_X=0.0f,mag_Y=0.0f,mag_Z=0.0f,Yh=0.0f,Xh=0.0f;
float gap=0.0;
float temp,temp1;   //for temporary use

int flag=0, pidupdate=0;
	
//variables for kalman filter pitch
	
float Q_angle_pitch = 0.0001f;    //0.0001
//Q_gyroBias should be low, since gyro bias change extremely slow
float Q_ang_vel_pitch = 0.001f;    //100
float Q_gyroBias_pitch = 0.01f;     //0.003
//R_measure should be greater than Q_angle to prevent acceleration from affecting the angle
float R_angle_pitch = 100000.0f;       //1000
float R_ang_vel_pitch = 1.0f;     //0.001
float pitch_est=0.0f,pitch_inn=0.0f,pitch_rate=0.0f,pitch_ang_vel=0.0f,pitch_ang_vel_inn=0.0f,pitch_den=0.0f;
float pitch_P[3][3]={1000.0f,0.0f,0.0f,0.0f,1000.0f,0.0f,0.0f,0.0f,1000.0f};
float pitch_K[3][2]={0.0f};
float pitch_S[2][2]={0.0f};

//variables for kalman filter of roll
	
double Q_angle_roll = 0.0001f;    //0.001
//Q_gyroBias should be low, since gyro bias change extremely slow
double Q_ang_vel_roll = 0.001f;
double Q_gyroBias_roll = 0.01f;     //0.003
//R_measure should be greater than Q_angle to prevent acceleration from affecting the angle
double R_angle_roll = 100000.0f;       //0.03
double R_ang_vel_roll = 1.0f;
float roll_est=0.0f,roll_inn=0.0f,roll_rate=0.0f,roll_ang_vel=0.0f,roll_ang_vel_inn=0.0f,roll_den=0.0f;
float roll_P[3][3]={1000.0f,0.0f,0.0f,0.0f,1000.0f,0.0f,0.0f,0.0f,1000.0f};
float roll_K[3][2]={0.0f};
float roll_S[2][2]={0.0f};

