adarshmodh/quadcopter_STM32F3/quad_project.c
int test=0;
//float vel_z=0,act_z[2]=0;

uint16_t IC3ReadValue1 = 0, IC3ReadValue2 = 0, CaptureNumber = 0;
uint32_t echo_capture = 0; 
float height[2] = {0};
unsigned int echo_flag=0,trigger_flag=0;


float offset=0,pitch_est1=0,roll_est1=0,roll_est_temp[2]={0},pitch_est_temp[2]={0},yaw_est_temp[2]={0};

int fputc1(int ch, FILE *f)
{
    return(ITM_SendChar(ch));
}



uint16_t CCR1,ii,go,start;
uint32_t iii;

uint8_t update_flag;
int takeaction=0;
int dutta=0;
long a_uart=0;
uint16_t CCR1_Val = 0;
uint16_t CCR2_Val = 0;
uint16_t CCR3_Val = 0;
uint16_t CCR4_Val = 0;

unsigned int edge1=0,edge2=0,edge3=0,edge4=0,edge5=0,edge6=0,edge7=0,edge8=0,frequency=0,CCR=0,init=54,final=35949,CCRshow=0,flag1=0;
float Capture[2]={0.0f},CCR_3=0.0f,CCR_2=0.0f,gap1=0.0f;
int counts1=0,start1=0,check1=0,counter1=0;
int counts2=0,check2=0;

int counts3=0,check3=0,counter3=0;
float CCR_1=0.0f;
unsigned int kill_sw=0;
unsigned int absCCR_1=0,prevabsCCR_1[5]={0};

#ifdef __GNUC__
  /* With GCC/RAISONANCE, small printf (option LD Linker->Libraries->Small printf
     set to 'Yes') calls __io_putchar() */
  #define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
  #define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */

unsigned long	usartdata=0;
unsigned int usartsend,var=0,i=0;	
	
float speed_track_error=0,c7=0.2,c8=0.4,set_height_change=0,height_change=0, lambda=1;	
//////////////0.3 0.5 1

float prev_ccr_yaw[order]={0.0f},fltr_ccr_yaw=0;
int med_i=0,med_flag=0;

int back_flag=0,yaw_flag=0;	

int main(void)
{

 	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA|RCC_AHBPeriph_GPIOD | RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOC | RCC_AHBPeriph_GPIOE, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2 | RCC_APB1Periph_TIM3 | RCC_APB1Periph_TIM4 |RCC_APB1Periph_TIM6 | RCC_APB1Periph_TIM7, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1|RCC_APB2Periph_TIM15, ENABLE);
	
  gyroConfig();
	Acc_Config();
  TIM_Config();
  GPIO_Config();  
	compassConfig();
	USART3_Config();
	
	/* TIM enable counter */
  TIM_Cmd(TIM2, ENABLE);
	TIM_Cmd(TIM4, ENABLE);
	TIM_Cmd(TIM3, ENABLE);
	TIM_Cmd(TIM6, ENABLE);
	TIM_Cmd(TIM7, ENABLE);
	
	TIM_Cmd(TIM1, ENABLE);
	TIM_Cmd(TIM15, ENABLE);
	
  /* Enable the CC2 Interrupt Request */
  TIM_ITConfig(TIM2, TIM_IT_CC4, ENABLE);
	TIM_ITConfig(TIM2, TIM_IT_CC3, ENABLE);
	TIM_ITConfig(TIM2, TIM_IT_CC2, ENABLE);
	TIM_ITConfig(TIM2, TIM_IT_CC1, ENABLE);
	

	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
	TIM_ITConfig(TIM6, TIM_IT_Update, ENABLE);
	TIM_ITConfig(TIM7, TIM_IT_Update, ENABLE);
	
	
	kangle=180.0f/3.14;
	
	
  /* Infinite loop */
  while (1)
  {
	//	if(kill_sw==1)
		{		

		//usart_send();		
			
		if(takeaction==1)
		{
						
			takeaction=0; 
			
			if(kill_sw==1)
			{
			ccr_throttle=CCR;
				
	//			if(ccr_throttle>750)
	//			ccr_throttle=750;	
		  
			TIM3->CCR1=CCR1_Val;     //front
			TIM3->CCR4=CCR2_Val;     //back
 			TIM3->CCR2=CCR3_Val;     //left
			TIM3->CCR3=CCR4_Val;     //right
			}
			
			else
			{
			ccr_throttle=0;
		  TIM3->CCR1=0;     //front
			TIM3->CCR4=0;     //back
 			TIM3->CCR2=0;     //left
			TIM3->CCR3=0;     //right
			CCR1_Val=CCR2_Val=CCR3_Val=CCR4_Val=ccr_front_motor=ccr_back_motor=ccr_right_motor=ccr_left_motor=0;
			sum_roll=sum_pitch=sum_yaw=ccr_roll=ccr_pitch=fltr_ccr_yaw=ccr_height=0; 		
			//k_p[3]=0;
				
			}
			
    }	

		
 			if(pidupdate==1)
			{
				pidupdate=0;
				
				roll_est_temp[1] = (int) (roll_est*10);								
				roll_est_temp[1] = (roll_est_temp[1]/10);
				pitch_est_temp[1] = (int) (pitch_est*10);								
				pitch_est_temp[1] = (pitch_est_temp[1]/10);
				yaw_est_temp[1] = (int) (yaw_dir_avg*10);								
				yaw_est_temp[1] = (yaw_est_temp[1]/10);
				
					
				
			if(ccr_throttle>20 && offset==1500)
			{
				
//				
//				roll_est_temp = (int) (roll_est*10);								
//				roll_est_temp = (roll_est_temp/10);
//				pitch_est_temp = (int) (pitch_est*10);								
//				pitch_est_temp = (pitch_est_temp/10);
//				yaw_est_temp = (int) (yaw_dir*10);								
//				yaw_est_temp = (yaw_est_temp/10);
		
////				 	
				
				error_roll[0]= (error_roll[1]);
				error_roll[1]=(roll_est_temp[1]-set_roll-roll_est1);
				if(error_roll[1]>0.6)
				sum_roll=(sum_roll+(error_roll[1]*t));
				
				//if (error_roll[1]>3)
				//		k_i[0]=0;
				//for CCR=550, Kp=0.56,Kd=0.3	
					
				//if(error_roll[1]>1||error_roll[1]<-1)
				//kp=0.01795,ki=0,kd=0.0055
				ccr_roll=k_p[0]*error_roll[1] + k_i[0]*sum_roll + k_d[0]*(roll_est_temp[1]-roll_est_temp[0])/t;
				roll_est_temp[0] = roll_est_temp[1];
				//ccr_roll=0*error_roll[1] + 0*sum_roll + 0.3*GyroBuffer[1];
				//else
					
				//ccr_roll=0;
				//p_roll=k_p[0]*error_roll[1];
				//ccr_roll=(250*u_roll)/7.7;
				
				error_pitch[0]=(error_pitch[1]);
				error_pitch[1]=(pitch_est_temp[1]-set_pitch-pitch_est1);
				if(error_pitch[1]>0.6)
				sum_pitch=(sum_pitch+(error_pitch[1]*t));

				
				//if(error_pitch[1]>1||error_pitch[1]<-1)
				//kp=0.039,ki=0,kd=0.009, tested for CCR 580
				
				ccr_pitch=k_p[1]*error_pitch[1] + k_i[1]*sum_pitch + k_d[1]*(pitch_est_temp[1]-pitch_est_temp[0])/t;
				pitch_est_temp[0] = pitch_est_temp[1];
				
				
//				if(yaw_flag==4)
//					yaw_flag=0;
//				else
//					yaw_flag++;
//				
//				if (yaw_flag==4)
				{
				error_yaw[0]=(error_yaw[1]);
				error_yaw[1]=(yaw_est_temp[1]-set_yaw);
				if(error_yaw[1]>1)
				sum_yaw=(sum_yaw+(error_yaw[1]*t));
				
				//if(error_yaw[1]>0.5||error_yaw[1]<-0.5)
				//kp=0.02000,ki=0.00199,kd=0.0100	
					
				ccr_yaw=k_p[2]*error_yaw[1] + k_d[2]*(yaw_est_temp[1]-yaw_est_temp[0])/t;
				
				//ccr_yaw=k_p[2]*error_yaw[1] + 0*(error_yaw[1]-error_yaw[0])/t;
				
				yaw_est_temp[0] = yaw_est_temp[1];
				
				//fltr_ccr_yaw = ccr_yaw;
				fltr_ccr_yaw=0.1*ccr_yaw+0.9*fltr_ccr_yaw;
				}
	
//				prev_ccr_yaw[med_i]=ccr_yaw;
//				med_i++;
//				if(med_i==order)
//				{
//					med_i=0;
//					med_flag=1;
//				}
//				
//				if(med_flag==1)
//				med_filter(order);
//				
				
				if(set_height[1]>=50&& back_flag==1)
				{
				back_flag=0;	
				error_height[0]=error_height[1];
				error_height[1]=(set_height[1]-height[1])/100;   /////100 divide for backstep
				if(error_height[1]>0.05)
				sum_height=sum_height+(error_height[1]*(t*10));
				
					set_height_change=((set_height[1]/100)-set_height[0])/(t*10);
					set_height[0]=set_height[1]/100;
					height_change=((height[1]/100)-height[0])/(t*10);
					height[0]=height[1]/100;						
					
					speed_track_error= (c7*error_height[1]+set_height_change+lambda*sum_height-height_change);					
// back-stepping for the height
					ccr_height= (1.2/(cos(pitch_est/kangle)*cos(roll_est/kangle)))*(9.8+(1-(c7*c7)+lambda)*error_height[1]+(c7+c8)*speed_track_error-c7*lambda*sum_height+(height_change/(t*10)));					
				
				
