adarshmodh/quadcopter_STM32F3/quad_project.c
				//ccr_height=k_p[3]*error_height[1] + k_i[3]*sum_height + k_d[3]*(error_height[1]-error_height[0])/t;
				}

				
				mpitch=meas[0];
				mroll=meas[1];
				myaw=meas[2];
				
				
				ccr_front_motor=ccr_throttle+ccr_height+ccr_pitch-fltr_ccr_yaw;
					if(ccr_front_motor>850)
						ccr_front_motor=850;
					if(ccr_front_motor<520)
						ccr_front_motor=520;
				
				ccr_back_motor=ccr_throttle+ccr_height-ccr_pitch-fltr_ccr_yaw;
					if(ccr_back_motor>850)
						ccr_back_motor=850;
					if(ccr_back_motor<520)
						ccr_back_motor=520;
					
				ccr_left_motor=ccr_throttle+ccr_height+ccr_roll+fltr_ccr_yaw;
					if(ccr_left_motor>850)
						ccr_left_motor=850;
					if(ccr_left_motor<520)
						ccr_left_motor=520;
					
				ccr_right_motor=ccr_throttle+ccr_height-ccr_roll+fltr_ccr_yaw;
					if(ccr_right_motor>850)
						ccr_right_motor=850;
					if(ccr_right_motor<520)
						ccr_right_motor=520;
				}
				
				else
				{
					ccr_front_motor=ccr_throttle;
					ccr_back_motor=ccr_throttle;
					ccr_left_motor=ccr_throttle;
					ccr_right_motor=ccr_throttle;
				}
				
			CCR1_Val = ccr_front_motor;
			CCR2_Val = ccr_back_motor;
			CCR3_Val = ccr_left_motor;
			CCR4_Val = ccr_right_motor;
			}					   			


			
	if(readsensor==1)		
	{
		readsensor=0;	
					
//		test_flag();		
		get_height();
		
		gyroReadAngRate(GyroBuffer);
		Acc_ReadData(AccBuffer);
		compassReadMag(MagBuffer);

								
		if(n<500)			
				{
					for(k=0; k<3; k++)
					{
 					 	Gyroavg_2[k]+=GyroBuffer[k];	
 				  }
				}
			n++;
			
		if(n==500)
			{
				
				for(k=0; k<3; k++)
					{
 					 	Gyrooffset[k]=Gyroavg_2[k]/500.0f;
						if(-2.0f>Gyrooffset[k]||Gyrooffset[k]>2.0f)
							Gyrooffset[k]=Gyrooffset_prev[k];
						Gyrooffset_prev[k]=Gyrooffset[k];
						Gyroavg_2[k]=0.0f;	
 				  }
				
			}	
				
		if(n>=500)
			{
				n=521;
				read5++;
				
				if(read5==6)
				{read5=1;}
				
 				for(k=0; k<3; k++)
 				{
 						Gyroavg[k]+=read5*GyroBuffer[k];
						Accavg[k]+=read5*AccBuffer[k];
						Magavg[k]+=read5*MagBuffer[k];
 				}
				
				
				if(read5==5)
				{
					
					 
					
						for(k=0; k<3; k++)
						{
							Gyroavg_1[k]=Gyroavg[k]/15.0f;
							//temp=(float)((Gyroavg[k]-Gyrooffset[k]*5.0)/15.0f*t);
							temp=(float)((Gyroavg_1[k]-Gyrooffset[k])*t);
							//Gyroangle[k]=-1.0*meas[k]+temp;	
							Gyroangle[k]=-1.0f*meas[k]+temp;	
							//Gyrorate[k]=Gyroavg[k]/5.0f-Gyrooffset[k];
							Gyroavg[k]=0.0f;
						Accavg_1[k]=Accavg[k]/15.0f;
						Accavg[k]=0;
						
						Magavg_1[k]=Magavg[k]/15.0f;
						Magavg[k]=0;	
							
						}
						
					
						//0-pitch 1-roll 2-yaw
						
							
 				
				
							x=(0.001*Accavg_1[0])+(0.0197);
							y=(0.001*Accavg_1[1])-(0.0119);
							z=(0.001*Accavg_1[2])+(0.0508);
						
						
//						/**********velocity code***************/
//					  act_z[0]=act_z[1]; 
//						act_z[1]=z-0.98;
//					vel_z=((act_z[0])*0.005)*10;	
//						
						
						
						
						
// 							x=(0.01*AccBuffer[0])+(0.0197);
// 							y=(0.01*AccBuffer[1])-(0.0119);
// 							z=(0.01*AccBuffer[2])+(0.0508);
// 				
							avg=(float)sqrt((((float)x)*((float)x))+(((float)y)*((float)y))+(((float)z)*((float)z)));
							roll_acc=(asin((y)/avg))*kangle;
							pitch_acc=(asin((x)/avg))*kangle;
						
						
			
						


						//meas[0]=-1.0*Gyroangle[0]*0.98 + pitch_acc*0.02;
					//	meas[1]=-1.0*Gyroangle[1]*0.98 + roll_acc*0.02;


						
						
				
						
						Mag_abs=sqrt((Magavg_1[0]*Magavg_1[0])+(Magavg_1[1]*Magavg_1[1])+(Magavg_1[2]*Magavg_1[2]));
						mag_X=MagBuffer[0]/Mag_abs;
						mag_Y=MagBuffer[1]/Mag_abs;
						mag_Z=MagBuffer[2]/Mag_abs;
						
						a=(mag_Y*cos(meas[1]/kangle));
						b=(mag_Z*sin(meas[1]/kangle));
						Yh=a-b;
						Xh=mag_X*cos(meas[0]/kangle)+mag_Y*sin(meas[1]/kangle)*sin(meas[0]/kangle)+mag_Z*cos(meas[1]/kangle)*sin(meas[0]/kangle);
						
						dir=atan(Yh/Xh)*(kangle);
						
						if(Xh>0&&Yh>0)
						
						{			dir=-180+dir;
								  //mag_angle=dir;
						}
						
						if(Xh>0&&Yh<0)
						{			dir=180+dir;
									//mag_angle=dir;
						}
 						
 							
 						///dir = dir+180;

						if(m==1)
						initdir=dir;
						m=2;
						
						//yaw_dir = angle * acos(cos((90-dir)/angle) * cos(initdir/angle) + sin((90-dir)/angle)*sin(initdir/angle));
					//	yaw_dir = angle * asin(-sin((dir)/angle) * cos(initdir/angle) + cos((dir)/angle)*sin(initdir/angle));
							sin_angle =(-sin((dir)/angle) * cos(initdir/angle) + cos((dir)/angle)*sin(initdir/angle));
							cos_angle =(cos((dir)/angle) * cos(initdir/angle) + sin((dir)/angle)*sin(initdir/angle));
							yaw_dir=angle*acos(cos_angle);
							if (sin_angle>0 && cos_angle >0)
								yaw_dir=yaw_dir;
							if (sin_angle>0 && cos_angle <0)
								yaw_dir=yaw_dir;
							if (sin_angle<0 && cos_angle <0)
								yaw_dir=-yaw_dir;
							if (sin_angle<0 && cos_angle >0)
								yaw_dir=-yaw_dir;
							yaw_dir_avg=0.8*yaw_dir_avg+0.2*yaw_dir;
				}
				

								
			//***********************your space*******************************
									//LKF for pitch measurements

//state prediction
pitch_rate=pitch_ang_vel-Gyrooffset[0];
pitch_est=pitch_est+(t_kal*pitch_rate);        

//Covariance prediction

pitch_P[0][0] = pitch_P[0][0] + t_kal*(pitch_P[1][0]-pitch_P[2][0]) + t_kal*(pitch_P[0][1] + t_kal*(pitch_P[1][1]-pitch_P[2][1])) - t_kal*(pitch_P[0][2] + t_kal*(pitch_P[1][2]-pitch_P[2][2])) + Q_angle_pitch;
pitch_P[0][1] = pitch_P[0][1] + t_kal*(pitch_P[1][1]-pitch_P[2][1]);
pitch_P[0][2] = pitch_P[0][2] + t_kal*(pitch_P[1][2]-pitch_P[2][2]);
pitch_P[1][0] = pitch_P[1][0] + t_kal*pitch_P[1][1] - t_kal*pitch_P[1][2];
pitch_P[1][1] = pitch_P[1][1] + Q_ang_vel_pitch;
pitch_P[1][2] = pitch_P[1][2];
pitch_P[2][0] = pitch_P[2][0] + t_kal*pitch_P[2][1] - t_kal*pitch_P[2][2];
pitch_P[2][1] = pitch_P[2][1];
pitch_P[2][2] = pitch_P[2][2] + Q_gyroBias_pitch;

//State innovation
pitch_inn=pitch_acc-pitch_est;
pitch_ang_vel_inn=-GyroBuffer[0]-pitch_ang_vel;         //significance of -ve sign before Gyroavg_1[0]

//covariance innovation
pitch_S[0][0] = pitch_P[0][0] + R_angle_pitch;
pitch_S[0][1] = pitch_P[0][1];
pitch_S[1][0] = pitch_P[1][0];
pitch_S[1][1] = pitch_P[1][1] + R_ang_vel_pitch;

//Kalman gain
pitch_den=(pitch_S[0][0]*pitch_S[1][1])-(pitch_S[0][1]*pitch_S[1][0]);
pitch_K[0][0] = ((pitch_P[0][0]*pitch_S[1][1])-(pitch_P[0][1]*pitch_S[1][0]))/pitch_den;
pitch_K[0][1] = (-(pitch_P[0][0]*pitch_S[0][1])+(pitch_P[0][1]*pitch_S[0][0]))/pitch_den;
pitch_K[1][0] = ((pitch_P[1][0]*pitch_S[1][1])-(pitch_P[1][1]*pitch_S[1][0]))/pitch_den;
pitch_K[1][1] = (-(pitch_P[1][0]*pitch_S[0][1])+(pitch_P[1][1]*pitch_S[0][0]))/pitch_den;
pitch_K[2][0] = ((pitch_P[2][0]*pitch_S[1][1])-(pitch_P[2][1]*pitch_S[1][0]))/pitch_den;
pitch_K[2][1] = (-(pitch_P[2][0]*pitch_S[0][1])+(pitch_P[2][1]*pitch_S[0][0]))/pitch_den;

//state update
pitch_est += (pitch_K[0][0] * pitch_inn) + (pitch_K[0][1] * pitch_ang_vel_inn);
pitch_ang_vel += (pitch_K[1][0] * pitch_inn) + (pitch_K[1][1] * pitch_ang_vel_inn);
Gyrooffset[0] += (pitch_K[2][0] * pitch_inn) + (pitch_K[2][1] * pitch_ang_vel_inn);

//covariance update
float pitch_P00_temp = pitch_P[0][0];
float pitch_P01_temp = pitch_P[0][1];
float pitch_P02_temp = pitch_P[0][2];
float pitch_P10_temp = pitch_P[1][0];
float pitch_P11_temp = pitch_P[1][1];
float pitch_P12_temp = pitch_P[1][2];

pitch_P[0][0]=(1-pitch_K[0][0])*pitch_P00_temp - pitch_K[0][1]*pitch_P10_temp;
pitch_P[0][1]=(1-pitch_K[0][0])*pitch_P01_temp - pitch_K[0][1]*pitch_P11_temp;
pitch_P[0][2]=(1-pitch_K[0][0])*pitch_P02_temp - pitch_K[0][1]*pitch_P11_temp;
pitch_P[1][0]= - pitch_K[1][0]*pitch_P00_temp + (1-pitch_K[1][1])*pitch_P10_temp;
pitch_P[1][1]= - pitch_K[1][0]*pitch_P01_temp + (1-pitch_K[1][1])*pitch_P11_temp;
pitch_P[1][2]= - pitch_K[1][0]*pitch_P02_temp + (1-pitch_K[1][1])*pitch_P11_temp;
pitch_P[2][0]= - pitch_K[2][0]*pitch_P00_temp - pitch_K[2][1]*pitch_P10_temp + pitch_P[2][0];
pitch_P[2][1]= - pitch_K[2][0]*pitch_P01_temp - pitch_K[2][1]*pitch_P11_temp + pitch_P[2][1];
pitch_P[2][2]= - pitch_K[2][0]*pitch_P02_temp - pitch_K[2][1]*pitch_P12_temp + pitch_P[2][2];

Gyroavg[0]=0;				


