adarshmodh/quadcopter_STM32F3/quad_project.c
//LKF for roll measurements

//state prediction
roll_rate=roll_ang_vel-Gyrooffset[1];
roll_est=roll_est+(t_kal*roll_rate);
//roll_ang_vel=-1.67*(CCR3_Val-CCR4_Val);          //significance of negative sign

//Covariance prediction

roll_P[0][0] = roll_P[0][0] + t_kal*(roll_P[1][0]-roll_P[2][0]) + t_kal*(roll_P[0][1] + t_kal*(roll_P[1][1]-roll_P[2][1])) - t_kal*(roll_P[0][2] + t_kal*(roll_P[1][2]-roll_P[2][2])) + Q_angle_roll;
roll_P[0][1] = roll_P[0][1] + t_kal*(roll_P[1][1]-roll_P[2][1]);
roll_P[0][2] = roll_P[0][2] + t_kal*(roll_P[1][2]-roll_P[2][2]);
roll_P[1][0] = roll_P[1][0] + t_kal*roll_P[1][1] - t_kal*roll_P[1][2];
roll_P[1][1] = roll_P[1][1] + Q_ang_vel_roll;
roll_P[1][2] = roll_P[1][2];
roll_P[2][0] = roll_P[2][0] + t_kal*roll_P[2][1] - t_kal*roll_P[2][2];
roll_P[2][1] = roll_P[2][1];
roll_P[2][2] = roll_P[2][2] + Q_gyroBias_roll;

//State innovation
roll_inn=roll_acc-roll_est;
roll_ang_vel_inn=-GyroBuffer[1]-roll_ang_vel;         //significance of -ve sign before Gyroavg_1[0]

//covariance innovation
roll_S[0][0] = roll_P[0][0] + R_angle_roll;
roll_S[0][1] = roll_P[0][1];
roll_S[1][0] = roll_P[1][0];
roll_S[1][1] = roll_P[1][1] + R_ang_vel_roll;

//Kalman gain
roll_den=(roll_S[0][0]*roll_S[1][1])-(roll_S[0][1]*roll_S[1][0]);
roll_K[0][0] = ((roll_P[0][0]*roll_S[1][1])-(roll_P[0][1]*roll_S[1][0]))/roll_den;
roll_K[0][1] = (-(roll_P[0][0]*roll_S[0][1])+(roll_P[0][1]*roll_S[0][0]))/roll_den;
roll_K[1][0] = ((roll_P[1][0]*roll_S[1][1])-(roll_P[1][1]*roll_S[1][0]))/roll_den;
roll_K[1][1] = (-(roll_P[1][0]*roll_S[0][1])+(roll_P[1][1]*roll_S[0][0]))/roll_den;
roll_K[2][0] = ((roll_P[2][0]*roll_S[1][1])-(roll_P[2][1]*roll_S[1][0]))/roll_den;
roll_K[2][1] = (-(roll_P[2][0]*roll_S[0][1])+(roll_P[2][1]*roll_S[0][0]))/roll_den;

//state update
roll_est += (roll_K[0][0] * roll_inn) + (roll_K[0][1] * roll_ang_vel_inn);
roll_ang_vel += (roll_K[1][0] * roll_inn) + (roll_K[1][1] * roll_ang_vel_inn);
Gyrooffset[1] += (roll_K[2][0] * roll_inn) + (roll_K[2][1] * roll_ang_vel_inn);

//covariance update
float roll_P00_temp = roll_P[0][0];
float roll_P01_temp = roll_P[0][1];
float roll_P02_temp = roll_P[0][2];
float roll_P10_temp = roll_P[1][0];
float roll_P11_temp = roll_P[1][1];
float roll_P12_temp = roll_P[1][2];

roll_P[0][0]=(1-roll_K[0][0])*roll_P00_temp - roll_K[0][1]*roll_P10_temp;
roll_P[0][1]=(1-roll_K[0][0])*roll_P01_temp - roll_K[0][1]*roll_P11_temp;
roll_P[0][2]=(1-roll_K[0][0])*roll_P02_temp - roll_K[0][1]*roll_P11_temp;
roll_P[1][0]= - roll_K[1][0]*roll_P00_temp + (1-roll_K[1][1])*roll_P10_temp;
roll_P[1][1]= - roll_K[1][0]*roll_P01_temp + (1-roll_K[1][1])*roll_P11_temp;
roll_P[1][2]= - roll_K[1][0]*roll_P02_temp + (1-roll_K[1][1])*roll_P11_temp;
roll_P[2][0]= - roll_K[2][0]*roll_P00_temp - roll_K[2][1]*roll_P10_temp + roll_P[2][0];
roll_P[2][1]= - roll_K[2][0]*roll_P01_temp - roll_K[2][1]*roll_P11_temp + roll_P[2][1];
roll_P[2][2]= - roll_K[2][0]*roll_P02_temp - roll_K[2][1]*roll_P12_temp + roll_P[2][2];	
		
		
		if (offset<1500)		
		{  
		   pitch_est1=pitch_est_temp[1];
			 roll_est1=roll_est_temp[1];
				offset++;
		}
						
	
		//	printf("\n%f",meas[0]);
			}//bracket for read5

			}
    	}
			//else		
			{
//			ccr_throttle=0;
//		  TIM3->CCR1=0;     //front
//			TIM3->CCR4=0;     //back
// 			TIM3->CCR2=0;     //left
//			TIM3->CCR3=0;     //right
//			CCR1_Val=CCR2_Val=CCR3_Val=CCR4_Val=ccr_front_motor=ccr_back_motor=ccr_right_motor=ccr_left_motor=0;
//			ccr_roll=ccr_pitch=ccr_yaw=0; 		
//				
			}
		
	}	
			
}
    	


void TIM_Config(void)
{  
 //timer 2 input capture
  
	//PrescalerValue=(uint16_t)(SystemCoreClock/500000)-1;
  TIM_TimeBaseStructure.TIM_Period = 35999;
  TIM_TimeBaseStructure.TIM_Prescaler = 79;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  
 
  TIM_ICInitStructure.TIM_Channel = TIM_Channel_4;
  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_BothEdge;
  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
  TIM_ICInitStructure.TIM_ICFilter = 0x0;
  TIM_ICInit(TIM2, &TIM_ICInitStructure);
  
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_3;
  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_BothEdge;
  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
  TIM_ICInitStructure.TIM_ICFilter = 0x0;
  TIM_ICInit(TIM2, &TIM_ICInitStructure);
	
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_BothEdge;
  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
  TIM_ICInitStructure.TIM_ICFilter = 0x0;
  TIM_ICInit(TIM2, &TIM_ICInitStructure);
	
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;
  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_BothEdge;
  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
  TIM_ICInitStructure.TIM_ICFilter = 0x0;
  TIM_ICInit(TIM2, &TIM_ICInitStructure);
	
  
	
//timer 3 pwm outputs
	PrescalerValue=(uint16_t)(SystemCoreClock/500000)-1;
  TIM_TimeBaseStructure.TIM_Period = 9999;
  TIM_TimeBaseStructure.TIM_Prescaler = PrescalerValue;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

  TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

  /* Init TIM_OCInitStructure */
  TIM_OCStructInit(&TIM_OCInitStructure);
  
  /* Output Compare Toggle Mode configuration: Channel1 */
  TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  TIM_OCInitStructure.TIM_Pulse = CCR1_Val;
  TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
  TIM_OC1Init(TIM3, &TIM_OCInitStructure);

  TIM_OC1PreloadConfig(TIM3, TIM_OCPreload_Disable);

