adarshmodh/quadcopter_STM32F3/quad_project.c
  LSM303DLHC_Read(MAG_I2C_ADDRESS, LSM303DLHC_OUT_X_H_M, buffer, 1);
  LSM303DLHC_Read(MAG_I2C_ADDRESS, LSM303DLHC_OUT_X_L_M, buffer+1, 1);
  LSM303DLHC_Read(MAG_I2C_ADDRESS, LSM303DLHC_OUT_Y_H_M, buffer+2, 1);
  LSM303DLHC_Read(MAG_I2C_ADDRESS, LSM303DLHC_OUT_Y_L_M, buffer+3, 1);
  LSM303DLHC_Read(MAG_I2C_ADDRESS, LSM303DLHC_OUT_Z_H_M, buffer+4, 1);
  LSM303DLHC_Read(MAG_I2C_ADDRESS, LSM303DLHC_OUT_Z_L_M, buffer+5, 1);
  /* Switch the sensitivity set in the CRTLB*/
  switch(CTRLB & 0xE0)
  {
  case LSM303DLHC_FS_1_3_GA:
    Magn_Sensitivity_XY = LSM303DLHC_M_SENSITIVITY_XY_1_3Ga;
    Magn_Sensitivity_Z = LSM303DLHC_M_SENSITIVITY_Z_1_3Ga;
    break;
  case LSM303DLHC_FS_1_9_GA:
    Magn_Sensitivity_XY = LSM303DLHC_M_SENSITIVITY_XY_1_9Ga;
    Magn_Sensitivity_Z = LSM303DLHC_M_SENSITIVITY_Z_1_9Ga;
    break;
  case LSM303DLHC_FS_2_5_GA:
    Magn_Sensitivity_XY = LSM303DLHC_M_SENSITIVITY_XY_2_5Ga;
    Magn_Sensitivity_Z = LSM303DLHC_M_SENSITIVITY_Z_2_5Ga;
    break;
  case LSM303DLHC_FS_4_0_GA:
    Magn_Sensitivity_XY = LSM303DLHC_M_SENSITIVITY_XY_4Ga;
    Magn_Sensitivity_Z = LSM303DLHC_M_SENSITIVITY_Z_4Ga;
    break;
  case LSM303DLHC_FS_4_7_GA:
    Magn_Sensitivity_XY = LSM303DLHC_M_SENSITIVITY_XY_4_7Ga;
    Magn_Sensitivity_Z = LSM303DLHC_M_SENSITIVITY_Z_4_7Ga;
    break;
  case LSM303DLHC_FS_5_6_GA:
    Magn_Sensitivity_XY = LSM303DLHC_M_SENSITIVITY_XY_5_6Ga;
    Magn_Sensitivity_Z = LSM303DLHC_M_SENSITIVITY_Z_5_6Ga;
    break;
  case LSM303DLHC_FS_8_1_GA:
    Magn_Sensitivity_XY = LSM303DLHC_M_SENSITIVITY_XY_8_1Ga;
    Magn_Sensitivity_Z = LSM303DLHC_M_SENSITIVITY_Z_8_1Ga;
    break;
  }
  
  for(i=0; i<2; i++)
  {
    pfData[i]=(float)((int16_t)(((uint16_t)buffer[2*i] << 8) + buffer[2*i+1])*1000)/Magn_Sensitivity_XY;
  }
  pfData[2]=(float)((int16_t)(((uint16_t)buffer[4] << 8) + buffer[5])*1000)/Magn_Sensitivity_Z;
}


void TIM2_IRQHandler(void)
{ 
	
   if(!(TIM_GetITStatus(TIM2, TIM_IT_CC4)) == RESET) 
   {
 		    
     TIM_ClearITPendingBit(TIM2, TIM_IT_CC4);
 		    
 		if(check==0)
			{
			  edge1 = TIM2->CCR4;
				check = 1;
			}
    else if(check==1) 
			{
				edge2 = TIM2->CCR4;
				check=0;
				counts=36000*counter + edge2-edge1;	
				
				//CCR=counts*500/900;
				CCR=(counts/2)+50;
				
//				if(CCR>730)
//					CCR=730;
				
//				CCR=(CCR/2)-250 ;
				
//				if(CCR>530)
//					throt_check=1;			

//				if (counts>36000)
//						counts=18000;		
//				CCR=(float)(counts-1350)*100.0/2700.0;      //5 degrees till 1600
//				//k_i[0]=0.5+CCR_3;
				
//				if(CCR>15)
//				set_height=CCR;		
//				else 
//				set_height=0; 		
				
				counter=0;
	     }
    }
	
	
	if(!(TIM_GetITStatus(TIM2, TIM_IT_CC3)) == RESET) 
  {
		TIM_ClearITPendingBit(TIM2, TIM_IT_CC3);
		
		if(check1==0)
			{
				edge3 = TIM2->CCR3;
				check1 = 1;
			}
    else if(check1==1) 
			{
				edge4 = TIM2->CCR3;
				check1=0;
				counts1=36000*counter1 + edge4-edge3;	
				
				if (counts1>36000)
						counts1=18000;
				CCR_3=(float)(counts1-1350)*100.0/2700.0;//5 degrees till 1600

//				k_i[1]= (int)(CCR_3+17);
//				k_i[1]= (k_i[1]/17)/8; 
//				k_i[1]= k_i[1]+0.2;
//					
				//k_d[2]= ((CCR_3/5));	
			//	k_p[2]=k_p[2]/5;
				set_roll=(-CCR_3);		
				set_roll = (int) (set_roll*10);
				set_roll = (float)(set_roll/10);	

				//k_p[1]=0.56+(-CCR_3	)/5;
//				k_p[1] = (int) (k_p[1]*1000);
//				k_p[1] = (float)(k_p[1]/1000);				
			//	k_i[2]=  (-CCR_3)/40;
				//k_i[2] = (int) (k_i[2]*1000);
				//k_i[2] = (float)(k_i[2]/1000);
				
				//set_pitch=-CCR_3;
				counter1=0;
			}
	}
	
	if(!(TIM_GetITStatus(TIM2, TIM_IT_CC2)) == RESET) 
  {
		TIM_ClearITPendingBit(TIM2, TIM_IT_CC2);
		
		if(check2==0)
			{
				edge5 = TIM2->CCR2;
				check2 = 1;
			}
    else if(check2==1) 
			{
				edge6 = TIM2->CCR2;
				check2=0;
				counts2=36000*counter2 + edge6-edge5;	
				if (counts2>36000)
						counts2=18000;
				CCR_2=(float)(counts2-1350)*100.0/2700.0;//5 degrees till 1600
								
				set_pitch=CCR_2;
				set_pitch = (int) (set_pitch*10);
				set_pitch = (float)(set_pitch/10);
				set_pitch = set_pitch; //3
				
				counter2=0;
			}
	}
	
	if(!(TIM_GetITStatus(TIM2, TIM_IT_CC1)) == RESET) 
  {
		TIM_ClearITPendingBit(TIM2, TIM_IT_CC1);
		
		if(check3==0)
			{
				edge7 = TIM2->CCR1;
				check3 = 1;
			}
    else if(check3==1) 
			{
				edge8 = TIM2->CCR1;
				check3=0;
				counts3=36000*counter3 + edge8-edge7;	
				if (counts3>36000)
						counts3=18000;
				
				CCR_1=(float)(counts3-1350)*100.0/2700.0;//5 degrees till 1600
												
				
//				
//				prevabsCCR_1[0] = prevabsCCR_1[1] ;
//				prevabsCCR_1[1] = prevabsCCR_1[2] ;
//				prevabsCCR_1[2] = prevabsCCR_1[3] ;
//				prevabsCCR_1[3] = prevabsCCR_1[4] ;
//				prevabsCCR_1[4] = CCR_1;									
//									
//				
//				CCR_1 = (unsigned int)(prevabsCCR_1[4]+prevabsCCR_1[3]+prevabsCCR_1[2]+prevabsCCR_1[1] +prevabsCCR_1[0])/5;
//				
//				CCR_1 = (unsigned int)(CCR_1);
				
				//CCR_1=CCR_1/4;
//				CCR_1=(unsigned int)(-CCR_1);
//				if(CCR_1<=3)
//					CCR_1=0;
//				
				absCCR_1 = (int) (CCR_1);
				
				set_height[1] = (int) (absCCR_1*10); 
				
				if(set_height[1]<=40)
					set_height[1]=0;

				if(set_height[1]>40 && set_height[1]<=70)
					set_height[1]=70;				
				
				if((set_height[1]>70))
					set_height[1]=100;
	
				
				if((abs(absCCR_1))>0)
				{
					kill_sw = 1;				
				}
				else //if(!((prevabsCCR_1==17)||(prevabsCCR_1==16)||(prevabsCCR_1==15)||(prevabsCCR_1==18)))
				{	
				//		kill_sw=1;
					kill_sw = 0;
					set_height[1]=0;
				}	
				
				
				
				
				counter3=0;
			}
	}
	
	
	
	if(!(TIM_GetITStatus(TIM2, TIM_IT_Update)) == RESET)
	{
		flag=1;
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
		if (check==1)
				counter++;
		
		if (check1==1)
				counter1++;
		
		if (check2==1)
				counter2++;
		
		if (check3==1)
			counter3++;
	}
}


