adarshmodh/quadcopter_STM32F3/quad_project.c
void TIM6_DAC1_IRQHandler(void)
{
	if(!(TIM_GetITStatus(TIM6, TIM_IT_Update)) == RESET)
	{
		TIM_ClearITPendingBit(TIM6, TIM_IT_Update);
		takeaction=1;
		readsensor=1;
		
		static int backstep=0;
		
		if(backstep<10)
			backstep++;
		else
		{
			backstep=0; 
			back_flag=1;
		}
	}
}


void TIM7_DAC2_IRQHandler(void)
{
	if(!(TIM_GetITStatus(TIM7, TIM_IT_Update)) == RESET)
	{
		TIM_ClearITPendingBit(TIM7, TIM_IT_Update);
		pidupdate=1;
		
//		static int tim7check =0, tim7flag=0;
//		tim7check++;
//		if(tim7check==100)
//		{tim7flag++;tim7check=0;}
		
	}
}

void TIM1_CC_IRQHandler(void)
{ 
   if(!(TIM_GetITStatus(TIM1, TIM_IT_CC2)) == RESET) 
  {
    /* Clear TIM1 Capture compare interrupt pending bit */
    TIM_ClearITPendingBit(TIM1, TIM_IT_CC2);
    if(CaptureNumber == 0)
    {
      /* Get the Input Capture value */
      IC3ReadValue1 = TIM_GetCapture2(TIM1);
      CaptureNumber = 1;
    }
    else if(CaptureNumber == 1)
    {
      /* Get the Input Capture value */
      IC3ReadValue2 = TIM_GetCapture2(TIM1); 
      
      /* Capture computation */
      if (IC3ReadValue2 > IC3ReadValue1)
      {
        echo_capture = (IC3ReadValue2 - IC3ReadValue1); 
      }
      else if (IC3ReadValue2 < IC3ReadValue1)
      {
        echo_capture = ((0xFFFF - IC3ReadValue1) + IC3ReadValue2); 
      }
      else
      {
        echo_capture = 0;
      }
      /* Frequency computation */ 
      height[1] = (int)(echo_capture/29/2);
						
			
			echo_flag=1;
			CaptureNumber = 0;
    }
  }
}

void TIM1_BRK_TIM15_IRQHandler(void)
{
	 if(!(TIM_GetITStatus(TIM15, TIM_IT_Update)) == RESET)
	{
		TIM_ClearITPendingBit(TIM15,TIM_IT_Update);
		trigger_flag=1;
		
	}
}	

void get_height(void)
{
		TIM_Cmd(TIM15,ENABLE);
		GPIOC->ODR &= ~(GPIO_Pin_0);
		while(!trigger_flag);
		trigger_flag=0;
		GPIOC->ODR |= (GPIO_Pin_0);
		while(!trigger_flag);
		trigger_flag=0;
		GPIOC->ODR &= ~(GPIO_Pin_0);
		TIM_Cmd(TIM15, DISABLE);	
	
}


//void test_flag(void)
//{
//	////////test flag////////////////
//				static int i1=1;
//				if(i1==1)
//				{
//						GPIOA->BSRR = 0x0004;
//						i1=0;
//				}
//				else
//				{
//						GPIOA->BRR = 0x0004 ;
//						i1=1;			
//				}		
//////////////////////////////////
//	
//}

//void usart_send(void)
//{
//	
//								usartdata =(roll_est + 100)*100;
//							//usartdata = (pitch_est+1000)*100;
//							//usartdata = (1000+1000)*1;
//							times=0;
//						//USART_SendData(USART3, 48);
//							while(times<5)							
//							{ 
//								a_uart= pow(10,4-times);
//								usartsend = usartdata/a_uart;
//								USART_SendData(USART3, usartsend+48);
//								usartdata = usartdata%a_uart;
//								times++;  
//								int i2=1000;                    //////475
//								while(i2--);
//							
//							}
//					//	USART_SendData(USART3, 13);
//						USART_SendData(USART3, 10);

//						
////		USART_SendData(USART3, var+48);
////		var++;
////		USART_SendData(USART3, 10);
////		while(i<1000)
////			i++;
////		if(i==1000)
////			i=0;
//	

//}

//void med_filter(int order_val)
//{

//	for (int c = 0 ; c < ( order_val - 1 ); c++)
//	  {
//	    for (int d = 0 ; d < (order_val - c - 1); d++)
//	    {
//	      if (prev_ccr_yaw[d] > prev_ccr_yaw[d+1]) /* For decreasing order use < */
//	      {
//	        float swap = prev_ccr_yaw[d];
//	        prev_ccr_yaw[d]   = prev_ccr_yaw[d+1];
//	        prev_ccr_yaw[d+1] = swap;
//	      }
//	    }
//	  }

//	fltr_ccr_yaw = prev_ccr_yaw[order_val/2];
//}


#endif